app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "vishal"], ["body", "vishal chutiya ahe"], ["created_at", "2015-04-19 09:14:51.002174"], ["updated_at", "2015-04-19 09:14:51.002174"]]
---
	def create
		@article = Article.new()
		@article.title = params[:article][:title]
		@article.body = params[:article][:body]
		@article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 12]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "mich re"], ["body", "tuch re"], ["updated_at", "2015-04-19 10:31:01.824619"], ["id", 12]]
---
	def update
		@article = Article.find(params[:id])
		@article.update(articles_params)